config.org
#+TITLE: Emacs Configuration
#+AUTHOR: Xavier Capaldi
#+PROPERTY: header-args :results silent :exports code

* Early init file
The [[https://www.gnu.org/software/emacs/manual/html_node/emacs/Early-Init-File.html][early init file]] is loaded before the package system or GUI is initialized.
We use it to disable ~package.el~ as we will use ~straight.el~ for package management.
#+BEGIN_SRC emacs-lisp :tangle early-init.el
  (setq package-enable-at-startup nil)
#+END_SRC

* Source this literate configuration
#+BEGIN_SRC elisp :tangle init.el
  (org-babel-load-file "~/.config/emacs/config.org")
#+END_SRC
  
* Package management
First bootstrap straight.el:
#+BEGIN_SRC emacs-lisp
  (defvar bootstrap-version)
  (let ((bootstrap-file
	 (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
	(bootstrap-version 5))
    (unless (file-exists-p bootstrap-file)
      (with-current-buffer
	  (url-retrieve-synchronously
	   "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	   'silent 'inhibit-cookies)
	(goto-char (point-max))
	(eval-print-last-sexp)))
    (load bootstrap-file nil 'nomessage))
#+END_SRC

** Install use-package
#+BEGIN_SRC emacs-lisp
  (straight-use-package 'use-package)
#+END_SRC

** Integration with use-package
We can tell use-package to invoke ~straight.el~ by default.

#+BEGIN_SRC emacs-lisp
  (setq straight-use-package-by-default 1)
#+END_SRC

* General emacs configuration
Wrap lines instead of extending past view.
#+BEGIN_SRC emacs-lisp
  (global-visual-line-mode 1)
#+END_SRC

GUI components
#+BEGIN_SRC emacs-lisp
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
#+END_SRC

Use visual bell
#+BEGIN_SRC emacs-lisp
  (setq ring-bell-function 1)
  (setq visible-bell t)
  (blink-cursor-mode 0)
#+END_SRC

Use UTF-8 by default
#+BEGIN_SRC emacs-lisp
  (setq coding-system-for-read 'utf-8)
  (setq coding-system-for-write 'utf-8)
#+END_SRC

Remove default start screen
#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-screen t)
#+END_SRC

Don't ask for confirmation following symlinked files
#+BEGIN_SRC emacs-lisp
  (setq vc-follow-symlinks t)
#+END_SRC

Store backup files in one location and automatically delete old versions.
#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
	backup-by-copying t
	version-control t
	delete-old-versions t
	kept-new-versions 20
	kept-old-versions 5)
#+END_SRC

Change frame title to match filename and major mode
%f will show full path.
This is crucial to work well with a dmenu script or rofi.
#+BEGIN_SRC emacs-lisp
  (setq-default frame-title-format '("%b [%m]"))
#+END_SRC

Define the menu key as the hyper key.
With this bound, you can use Hyper as a modifier with H-
Also if we still use space as our leader key, we can access it with H-<space> or Hyperspace.
A fundamental flaw however is that hyper isn't defined elsewhere on the system, notably in the terminal emulators.
So using emacs in the terminal will completely block your ability to use your hyper binds.
#+BEGIN_SRC emacs-lisp :tangle no
  (define-key key-translation-map (kbd "<menu>") 'event-apply-hyper-modifier)
#+END_SRC
* Foundational packages
** COMMENT Evil                                                               :dirty:
Evil-mode for vi emulation.
I'll leave this out for now as I'm trying to learn the default emacs bindings.
#+BEGIN_SRC emacs-lisp
  (use-package evil
    :straight t
    :init
    (evil-mode))
#+END_SRC

** COMMENT General                                                            :dirty:
I only consider this package to be required if you are using Evil since it adds a lot of nice functionality.
In particular, it allows you to bind keys specific to a certain Evil state.
My method of stacking hydras replaces the need for a leader key and almost all the other functionality is in ~use-package~.
For these reasons, this will also be ommitted until (if) I enable Evil again.
#+BEGIN_SRC emacs-lisp
  (use-package general
    :straight t)
#+END_SRC

*** option 1
Set caps lock to menu -> hyper.
Then bind it to evil-normal-state in insert and visual modes.
Bind hyper + space or alt + hyper to leader-def for general.
In normal and emacs modes, bind hyper to leader-def.
Use hyper to access quick commands and hydras:
H a -> avy-goto
H A -> avy-hydra
H f -> find-file
H F -> file-hydra
H p -> programming hydra

Advantages are that you can access frequent commands in two presses.
Disadvantage is that pressing hyper alone won't bring up a contextual menu displaying info.
Maybe this is faster?

*** option 2
Set caps lock to menu -> hyper.
Then bind it to evil-normal-state in insert and visual modes.
Bind hyper + space or alt + hyper to hyper-hydra.
In normal and emacs modes, bind hyper to hyper-hydra.

Advantages are contextual menu
Maybe slower?
Space is better for ergonomics but means in emacs mode you always need to combine with a modifier.

*** option 3
None of the above were possible with the hacked together hyper key, so I ended up just falling back on space to launch my main hydra.

** Hydra                                                              :dirty:
Hydra for keybinding menus
This is the most important and most powerful package to make emacs amazing.
In particular, I create nested hydras which can be modified when an external package is loaded.
Everything is accessed through a master hydra (bound to SPC).
This is functionally equivalent to a leader-key from general but I prefer adding my own annotations and it doesn't require ~which key~.
In addition, I find hydra is more responsive.
Then from the master hydra, I can bind commands or open other more specific hydras.
For example, "SPC f f" launches the master-hydra, then launches the file-hydra and then runs find-file.
Later, I can dynamically add hydras using defhydra+ with external packages.
Unfortunately every hydra must contain one binding which I just use to go back to the prior hydra
#+BEGIN_SRC emacs-lisp
  (use-package hydra
    :bind ("C-c SPC" . hydra-master/body))
#+END_SRC

** hydra-master
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-master (:color blue
                                 :columns 4)
    "Master"
    ("f" hydra-file/body "file")
    ("c" xcc/hydra-launcher "mode"))
#+END_SRC

** hydra-file
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-file (:color blue
                               :columns 4)
    "File"
    ("f" find-file "find file"))
#+END_SRC

** hydra-mode
We want this to be context dependant.
#+BEGIN_SRC emacs-lisp
  (defun xcc/hydra-launcher ()
    "A launcher for code-assisting hydras based on current major mode."
    (interactive)
    (cl-case major-mode
      ('python-mode (hydra-python/body))
      (t (message "No hydra for this major mode: %s" major-mode))))
#+END_SRC

* Org
This block *must* fall before any blocks that requires org-mode because they will cause Straight.el to install the latest version of org-mode which will cause conflicts.
** Organization
*** Worker methodology
My planner philosophy is heavy tailored to my work in graduate school.
My work is very diverse and usually (non-COVID) requires moving around from lab to lab.
I have used the Franklin Covey planner and planning method since I was 16 (10 years).
While I think it is an excellent planner, I find it lacking in some regards.
There are many benefits to the Franklin planner in particular.
Anywhere I go, I know I have a clear picture of my deadlines and schedules.
I can meet anyone impromptu and still be fully capable of planning my week.
I'm not tied to my phone or a computer.
I can make notes during meetings and record important information for permanent record.
It makes an impression.
Carrying a faux-leather-bound thicc-boi planner really makes a statement and several people have remarked.
*** Limitations of the Franklin
I really think it is the ideal planner for a worker.
What I mean is that, if I had a job, almost any job, where I wasn't planning large projects or managing other people, this planner would be sufficient.
However as soon as you start doing those things, I find it a bit insufficient as a manager's planner.
There are also some other limitations.
In particular, it can be hard to track delegated tasks.
Notes in particular meetings can get lost and are hard to reference because they must go by date.
The planning space is fundamentally limited which means you must omit smaller tasks.
Time-tracking is tedious and the daily tracker is designed for an era where you didnt' receive hundreds of emails.
Repeat tasks are tedious to implement.
In general I find it very hard to structure a large project.
If I try to plan in advance, invariably the plan changes and I either have to go back and erase the entire plan, if I had the foresight to use pencil, or I have a permanent irrelevant plan cluttering things up.
The Franklin system seems to work best, in my position, when used to track and plan about 2 - 3 weeks ahead.
That being said, I still really like and will continue to use it in my day-to-day.
So how then do I organize everything else?
I'm working on a hybrid organization system.
The Franklin planner is for me, the worker, while the Org planner is for me, the manager.
The manager can dispatch tasks to the worker at regular intervals (every morning).
Then the working takes over and operates from the Franklin all day.
At the end of the day, the worker reports to manager and the manager can then plan the next day.
In principle, there could be multiple workers but for now that functionality will be limited.
*** Manager methodologies
Since I've already discussed the worker's Franklin system I will talk about the manager.
There are many planning methodologies, most of which simply don't work for me.
We have agile methodologies like sprints and scrum.
We have kanbam boards.
We have gantt charts.
PhD research is fundamentally chaotic.
It is nearly impossible to plan a project from start to end or to accurately estimate dates.
However, despite the name, agile methodologies aren't a good fit.
In the agile system, a discrete and complete subproject is set as a short-term sprint goal and then the entire team works to reach that goal.
The idea, combined with burndown charts, is attractive but my research can get held up suddenly at any point which means the sprint turns into a marathon.
In addition, it relies on estimating effort which is very hard.
Finally a have to push in several different directions in my life: 1-2 research projects, teaching, home work, preparing to get a job, volunteer.
Agile is suited toward focusing on one goal.
Kanbam is another method which relies on electronic boards with cards to track task progress and completion.
It's very flexible and doesn't require a particular methodology.
Probably if I were another person, this would be the best option in my situation.
I just find kanbam very disgusting.
I prefer keeping my planning in a format that I can manage.
I don't like using a proprietary service.
I find a densely filled kanbam board to be terrible for actually working on a project.
It's like looking at remnants of the body of a manager who accepted too many tasks, became bloated, and then exploded, leaving kanbam cards scattered across a screen in multiple hues.
Gantt charts are the oldest and most intuitive method.
They were designed originally to streamline the munitions pipeline in WWII.
The idea is that you can pick your deadline and then work backwards based on time to complete tasks, worker allocations and dependencies to create a clear image of the entire project.
In it's original form, this won't work either because we can't really estimate time to complete tasks and oftentimes the PI will add work which means restructuring the entire tree.
However, something like this is what I am aiming for and I think org-mode can be well-suited toward it.
*** Org-mode planning
There are several agenda files, each of which will fill different roles and implement different features in Org.

**** personal.org
This document will contain non-project or work-related tasks.
There will be many recurring tasks for household duties.
Habits can be tracked here as well.
A key point is that time-tracking is largely unnecessary here and archiving can be very simple.
Recurring dates of interest will also fall here.

**** inbox.org/Franklin
This would be a file for rapidly storing tasks which come in while working at the computer.
The purpose is to be able to add the task and get back to work.
At the end of the day they can be filed into their correct project folders.
However, during the day, the Franklin serves this purpose quite well.
Tasks can be filed in their respective projects straight from the planner at the end of the day.

**** phd.org
This file contains all PhD projects.
These projects will not be archived as I want easy (structured) access to everything.

**** project_A.org
Individual projects can have their own org planning file.
These projects are similar to phd.org but smaller in scope.
Again, nothing should need to be archived within a single project.
Each project should be completely distinct from another.
It isn't possible to specify dependencies across files.

**** archive.org
This file isn't parsed for org agenda and serves as an archive of items from personal.org.
Since archiving doesn't allow for precise positioning, it is only really record but can't be used to generate time records.

