config.el
(defvar bootstrap-version)
(let ((bootstrap-file
       (expand-file-name "straight/repos/straight.el/bootstrap.el" user-emacs-directory))
      (bootstrap-version 5))
  (unless (file-exists-p bootstrap-file)
    (with-current-buffer
	(url-retrieve-synchronously
	 "https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"
	 'silent 'inhibit-cookies)
      (goto-char (point-max))
      (eval-print-last-sexp)))
  (load bootstrap-file nil 'nomessage))

(straight-use-package 'use-package)

(setq straight-use-package-by-default 1)

(global-visual-line-mode 1)

(tool-bar-mode -1)
(menu-bar-mode -1)
(scroll-bar-mode -1)

(setq ring-bell-function 1)
(setq visible-bell t)
(blink-cursor-mode 0)

(setq coding-system-for-read 'utf-8)
(setq coding-system-for-write 'utf-8)

(setq inhibit-startup-screen t)

(setq vc-follow-symlinks t)

(setq backup-directory-alist '(("." . "~/.config/emacs/backup"))
      backup-by-copying t
      version-control t
      delete-old-versions t
      kept-new-versions 20
      kept-old-versions 5)

(setq-default frame-title-format '("%b [%m]"))

(use-package hydra
  :bind ("C-c SPC" . hydra-master/body))

(defhydra hydra-master (:color blue
                               :columns 4)
  "Master"
  ("f" hydra-file/body "file")
  ("c" xcc/hydra-launcher "mode"))

(defhydra hydra-file (:color blue
                             :columns 4)
  "File"
  ("f" find-file "find file"))

(defun xcc/hydra-launcher ()
  "A launcher for code-assisting hydras based on current major mode."
  (interactive)
  (cl-case major-mode
    ('python-mode (hydra-python/body))
    (t (message "No hydra for this major mode: %s" major-mode))))

(use-package org
  :straight (:type built-in)
