config.org
** Configuration
#+BEGIN_SRC emacs-lisp
  (use-package org
    :straight (:type built-in)
    :bind (:map org-mode-map
		;; These commands would normally add current org file to agenda.
		;; Better do assign them manually with org-agenda-files
		("C-c [" . nil)
		("C-c ]" . nil))
    ;; Use virtual identation
    :hook ((org-mode . org-indent-mode))
    :config
    ;; Don't indent text by default
    ;; Technically this is disabled automatically with org-indent-mode
    (setq org-adapt-indentation nil)
    ;; Define all project files or files that contain dates
    (setq org-agenda-files
	  '("/home/xavier/Dropbox/org/personal.org"
	    "/home/xavier/Dropbox/org/archive.org"
	    "/home/xavier/Dropbox/org/phd.org"
	    "/home/xavier/Dropbox/org/birthdays.org"))
    ;; 
    (setq org-agenda-start-with-log-mode t)
    (setq org-deadline-warning-days 14)
    (setq org-log-done 'time)
    (setq org-log-into-drawer t)

    (setq org-todo-keywords
	  '((sequence "TODO(t)" "|" "DONE(d!)")
	    (sequence "EMAIL(e)" "WAIT(w@/!)" "HOLD(h@/!)" "MEETING(m)" "|" "CANCELLED(c@/!)")))
    ;; select a todo from any in the above list quickly
    (setq org-use-fast-todo-selection t)

    ;; Enforce todo dependencies
    ;; Parent nodes can only be finished if all children are finished
    (setq org-enforce-todo-dependencies t)
    (setq org-enforce-todo-checkbox-dependencies t)
    ;; Tasks which have unfulfilled dependencies (children or those linked by org-edna) will remain invisible on the agenda
    (setq org-agenda-dim-blocked-tasks 'invisible)

    ;; Habits
    ;;(require 'org-habit)
    (add-to-list 'org-modules 'org-habit)

    (setq org-file-apps '((auto-mode . emacs)
			  ("\\.mm\\'" . default)
			  ("\\.x?html?\\'" . default)
			  ("\\.pdf\\'" . "evince %s")))
    (org-babel-do-load-languages
     'org-babel-load-languages
     '((shell . t))))

    ;; Custom agenda view
    ;; Many of my tasks are blocked in my projects but some still have deadlines
    ;; that I will want a warning for
    ;;  https://stackoverflow.com/questions/29846732/make-emacs-org-mode-deadlines-and-scheduled-blocked-tasks-visible-in-agenda-view
    ;; (setq org-agenda-custom-commands
    ;; 	'(("c"
    ;; 	   "Agenda to show deadlines and hide blocked"
    ;; 	   (
    ;; 	    (agenda ""
    ;; 		    ((org-agenda-entry-types '(:deadline :scheduled))))
    ;; 	    (tags-todo "-TODO=\"DONE\""
    ;; 		       ((org-agenda-skip-entry-if 'deadline 'scheduled)
    ;; 			(org-agenda-dim-blocked-tasks 'invisible)))
    ;; 	    ))))

    ;; setup org-capture
    ;; Use franklin for capture for now
    ;; Might add this back later for notmuch integration
    ;; default directory where captures are stored
    ;; (setq org-default-notes-file "/home/xavier/Dropbox/inbox.org")

    ;; ;; Define capture templates
    ;; (setq org-capture-templates
    ;; 	  (quote (("t" "todo" entry (file "/home/xavier/Dropbox/inbox.org")
    ;; 		   "* TODO %?\n%U\n")
    ;; 		  ;;("e" "email" entry (file "/home/xavier/Dropbox/inbox.org")
    ;; 		  ;; "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :immediate-finish t)
    ;; 		  ("m" "meeting" entry (file "/home/xavier/Dropbox/inbox.org")
    ;; 		   "* MEETING with %? \n%U")))))
#+END_SRC

** COMMENT Org Edna
This package is only used for phd.org and project_A.org.
It allows defining dependencies and triggers.
Normal org mode can only specify hierarchical dependencies while org edna will allow non-linear dependencies.
#+BEGIN_SRC emacs-lisp
  (use-package org-edna
    :hook (org-mode-hook))
#+END_SRC

* Managing frames and windows
** COMMENT frames-only-mode
Use frames instead of windows whenever possible.
#+BEGIN_SRC emacs-lisp
  (use-package frames-only-mode
    :init
    (frames-only-mode 1))
#+END_SRC

* Search and completion framework
** Ivy
Ivy completion mechanism
#+BEGIN_SRC emacs-lisp
  (use-package ivy)
    ;;:general
    ;;(:keymaps 'ivy-minibuffer-map
    ;;          "H-<return>" 'ivy-dispatching-done)
    ;;:config)
    ;;(ivy-mode 1))
#+END_SRC

** Counsel
Counsel to improve basic emacs commands.
#+BEGIN_SRC emacs-lisp
  (use-package counsel)
    ;;:general
    ;; This option gives some nice information about the file location and type
    ;; ("C-x b" 'counsel-ibuffer)
    ;; But this option gives a file preview
    ;;("C-x b" 'counsel-switch-buffer)
    ;;:config
    ;;(counsel-mode 1))
#+END_SRC

** Swiper
Swiper to replace isearch and show overview of matches.
#+BEGIN_SRC emacs-lisp
  (use-package swiper)
#+END_SRC

* Paper writing and reference management
** ivy-bibtex
Search library easily.
#+BEGIN_SRC emacs-lisp
  (use-package ivy-bibtex
    :config
    (setq bibtex-completion-bibliography '("/home/xavier/Dropbox/library/references.bib"))
    (setq bibtex-completion-library-path '("/home/xavier/Dropbox/library"))
    (setq bibtex-completion-notes-path "/home/xavier/Dropbox/notes")
    (setq bibtex-completion-find-additional-pdfs t))
    ;; Use evince to open pdfs
    ;;(setq bibtex-completion-pdf-open-function
    ;;      (lambda (fpath)
    ;;        (call-process "evince" nil 0 nil fpath))))
#+END_SRC

** org-ref
Org-ref for managing bibliographies and writing in org-mode.
#+BEGIN_SRC emacs-lisp
  (use-package org-ref
    :init
    (setq org-ref-completion-library 'org-ref-ivy-cite)
    :config
    (setq reftex-default-bibliography '("/home/xavier/Dropbox/library/references.bib"))
    (setq org-ref-bibliography-notes "/home/xavier/Dropbox/notes")
    (setq org-ref-notes-function 'org-ref-notes-function-many-files)
    ;; don't create notes by default when adding files to library
    (setq doi-utils-make-notes t)
    (setq org-ref-default-bibliography '("/home/xavier/Dropbox/library/references.bib"))
    (setq org-ref-pdf-directory "/home/xavier/Dropbox/library")
    ;; since we use ivy-bibtex
    (setq bibtex-completion-bibliography "/home/xavier/Dropbox/library/references.bib"
          bibtex-completion-library-path "/home/xavier/Dropbox/library"
          bibtex-completion-notes-path "/home/xavier/Dropbox/notes")
    ;; format how we generate keys
    (setq bibtex-autokey-year-length 4
          bibtex-autokey-name-year-separator "-"
          bibtex-autokey-year-title-separator "-"
          bibtex-autokey-titleword-separator "-"
          bibtex-autokey-titlewords 2
          bibtex-autokey-titlewords-stretch 1
          bibtex-autokey-titleword-length 5))
#+END_SRC

** pdf-tools
#+BEGIN_SRC emacs-lisp
  (use-package pdf-tools
    :config
    (pdf-tools-install)
    (setq-default pdf-view-display-size 'fit-width))
#+END_SRC
* Note management
I have two use cases or types of notes that I want to store in the same database:
**** Bibliographic notes
I want to store a single note file for each paper in my literature library.
This will allow me to read and share notes on a particular paper since they are all gathered in one spot.
However I still want to be able to link particular notes on a paper with other notes so I will make extensive use of the node linking.
**** Other topic notes
Other topics may not be split by reference.
For example a topic on object oriented programming in python might just be an aggregate of my own experience and notes and thus it isn't important to maintain the same cohesion.
That could be one large note, several smaller notes or several smaller notes that I later summarize in a large note.
Since everything is plain text, refactoring later should not be terrible.
** org-roam
This package provides a pseudo-slipbox notetaking method which is quite sophisticated compared to alternatives.
Each file in the notes directory is a note node and within that file, headings can also be defined as nodes.
These nodes can all be linked together in a sort of mindmap.

#+BEGIN_SRC emacs-lisp
  (use-package org-roam
    :init
    (setq org-roam-v2-ack t)
    :config
    (setq org-roam-directory "/home/xavier/Dropbox/notes/"))

#+END_SRC

** org-roam-bibtex
Previously I preferred avoiding this package but version 2 of org-roam requires generated header IDs that will be generated automatically with this package.

#+BEGIN_SRC emacs-lisp
  (use-package org-roam-bibtex
    :after org-roam
    :config
    (require 'org-ref))
#+END_SRC
