config.org
* Syntax highlighting and visual support
** Font
#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist
               '(font . "Fira Mono-9"))
#+END_SRC
** Modus themes
#+BEGIN_SRC emacs-lisp
  (use-package modus-themes
    :init
    ;; add all customizations before loading theme

    ;; load theme files before enabling
    (modus-themes-load-themes)
    :config
    ;; load theme of choice
    (modus-themes-load-operandi))
#+END_SRC
** COMMENT Evil-goggles
#+BEGIN_SRC emacs-lisp
  (use-package evil-goggles
    :config
    (evil-goggles-mode))
#+END_SRC

** COMMENT Prism.el
I think standard syntax highlighting is largely useless.
When looking closely, you can just read the words and not rely on colors.
When looking at the document structure, the syntax highlighting is useless.
I tried my hand at making a minimal colorscheme for vim in the past and it was quite nice but didn't really change the underlying methodology.
This package by alphapapa effectively highlights code depth.
This is useful when looking closely because errors will still have highlighting issues.
It's also very useless when looking at the whole structure to understand the depth of your code.
Seems to have an issue with the emacs daemon so I set it not to tangle by default.
Once the daemon is running, you can run this block without problem.
#+BEGIN_SRC emacs-lisp
(use-package prism 
    ;; lisp and C-like languages use prism-mode
    ;;:ghook ('(emacs-lisp-mode-hook
    ;;          c-mode-hook))
    ;; for whitespace languages or those whose depth isn't indicated with parenthesis use prism-whitespace-mode
    ;;:ghook ('(python-mode-hook
    ;;          sh-mode-hook)
    ;;        #'prism-whitespace-mode)
    :config
    ;; work with modus themes
    (setq prism-num-faces 16)
    (prism-set-colors
      :desaturations '(0) ; may lower the contrast ratio
      :lightens '(0)      ; same
      :colors (modus-themes-with-colors
                (list fg-main
                      magenta
                      cyan-alt-other
                      magenta-alt-other
                      blue
                      magenta-alt
                      cyan-alt
                      red-alt-other
                      green
                      fg-main
                      cyan
                      yellow
                      blue-alt
                      red-alt
                      green-alt-other
                      fg-special-warm))))
#+END_SRC
** dimmer.el
* Python
#+BEGIN_SRC emacs-lisp
  (use-package python 
    :straight (:type built-in)
    ;;:mode ("\\.py\\" . python-mode)
    ;;:interpreter ("python" . python-mode)
    :config
    (defhydra hydra-python (:color blue
                                 :columns 4)
      "Coding"
      ("q" hydra-master/body "backlick")))
#+END_SRC
* Email
** Notmuch
#+BEGIN_SRC emacs-lisp
  (use-package notmuch
    :straight (:type built-in))
#+END_SRC

** msmtp
We need to ensure msmtp uses the proper email account to send messages.
This pulls the information from the header of the message we write in emacs.
#+BEGIN_SRC emacs-lisp
  (setq mail-specify-envelope-from t)
  (setq message-sendmail-envelope-from 'header)
  (setq mail-envelope-from 'header)
  (setq message-send-mail-function 'message-send-mail-with-sendmail
        sendmail-program "/bin/msmtp"
        user-full-name "Xavier Capaldi")
#+END_SRC

** gnus-alias
#+BEGIN_SRC emacs-lisp
  (use-package gnus-alias
    :hook ('message-setup . gnus-alias-determine-identity)
    :config
    (setq gnus-alias-use-buttonized-from nil)
    (setq gnus-alias-identity-alist
          '(("physics"
             nil ;; refer to any identity
             "Xavier Capaldi <capaldix@physics.mcgill.ca>"
             nil ;; organization header
             (("Fcc" . "/physics.mcgill/Sent")) ;; extra headers to save outgoing mail
             nil ;; extra body text
             nil) ;; signature
             ("scribo"
             nil ;; refer to other identity
             "Xavier Capaldi <xcapaldi@scribo.biz>"
             nil ;; organization header
             (("Fcc" . "/scribo/Sent")) ;; extra headers to save outgoing mail
             nil ;; extra body text
             nil) ;; signature
             ("giftedfleece"
              nil ;; refer to other identity
              "Xavier Capaldi <beeboy@giftedfleece.com>"
              nil ;; organization header
              (("Fcc" . "/giftedfleece/Sent")) ;; extra headers to save outgoing mail
              nil ;; extra body text
              nil) ;; signature
              ("gmail"
               nil ;; refer to other identity
               "Xavier Capaldi <xavier.capaldi@gmail.com>"
               nil ;; organization header
               (("Fcc" . "/gmail/Sent")) ;; extra headers to save outgoing mail
               nil ;; extra body text
               nil))) ;; signature
    ;; use "physics" identity by default
    (setq gnus-alias-default-identity "physics")
    ;; define rules to match other identities
    (setq gnus-alias-identity-rules
          '(("scribo" ("any"
                       "xcapaldi@scribo.biz"
                       both)
             "scribo")
            ("giftedfleece" ("any"
                             "beeboy@giftedfleece.com"
                             both)
             "giftedfleece")
            ("gmail" ("any"
                      "xavier.capaldi@gmail.com"
                      both)
             "gmail"))))
#+END_SRC
