config.el

(add-to-list 'default-frame-alist
             '(font . "Fira Mono-9"))

(use-package modus-themes
  :init
  ;; add all customizations before loading theme

  ;; load theme files before enabling
  (modus-themes-load-themes)
  :config
  ;; load theme of choice
  (modus-themes-load-operandi))

(use-package python 
  :straight (:type built-in)
  ;;:mode ("\\.py\\" . python-mode)
  ;;:interpreter ("python" . python-mode)
  :config
  (defhydra hydra-python (:color blue
                               :columns 4)
    "Coding"
    ("q" hydra-master/body "backlick")))

(use-package notmuch
  :straight (:type built-in))

(setq mail-specify-envelope-from t)
(setq message-sendmail-envelope-from 'header)
(setq mail-envelope-from 'header)
(setq message-send-mail-function 'message-send-mail-with-sendmail
      sendmail-program "/bin/msmtp"
      user-full-name "Xavier Capaldi")

(use-package gnus-alias
  :hook ('message-setup . gnus-alias-determine-identity)
  :config
  (setq gnus-alias-use-buttonized-from nil)
  (setq gnus-alias-identity-alist
        '(("physics"
           nil ;; refer to any identity
           "Xavier Capaldi <capaldix@physics.mcgill.ca>"
           nil ;; organization header
           (("Fcc" . "/physics.mcgill/Sent")) ;; extra headers to save outgoing mail
           nil ;; extra body text
           nil) ;; signature
           ("scribo"
           nil ;; refer to other identity
           "Xavier Capaldi <xcapaldi@scribo.biz>"
           nil ;; organization header
           (("Fcc" . "/scribo/Sent")) ;; extra headers to save outgoing mail
           nil ;; extra body text
           nil) ;; signature
           ("giftedfleece"
            nil ;; refer to other identity
            "Xavier Capaldi <beeboy@giftedfleece.com>"
            nil ;; organization header
            (("Fcc" . "/giftedfleece/Sent")) ;; extra headers to save outgoing mail
            nil ;; extra body text
            nil) ;; signature
            ("gmail"
             nil ;; refer to other identity
             "Xavier Capaldi <xavier.capaldi@gmail.com>"
             nil ;; organization header
             (("Fcc" . "/gmail/Sent")) ;; extra headers to save outgoing mail
             nil ;; extra body text
             nil))) ;; signature
  ;; use "physics" identity by default
  (setq gnus-alias-default-identity "physics")
  ;; define rules to match other identities
  (setq gnus-alias-identity-rules
        '(("scribo" ("any"
                     "xcapaldi@scribo.biz"
                     both)
           "scribo")
          ("giftedfleece" ("any"
                           "beeboy@giftedfleece.com"
                           both)
           "giftedfleece")
          ("gmail" ("any"
                    "xavier.capaldi@gmail.com"
                    both)
           "gmail"))))
